saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MIMXRT1064_DFP.10.0.0.pdsc
    <condition id="device.MIMXRT1064_driver.edma">
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.1.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="edma"/>
    </condition>
    <condition id="device.MIMXRT1064_driver.common">
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.1.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="clock"/>
      <require Cclass="Device" Cgroup="SDK Drivers" Csub="common"/>
    </condition>
    <condition id="device.MIMXRT1064">
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.1.1"/>
      <require Cclass="Device" Cgroup="Startup"/>
    </condition>
    <condition id="devices.MIMXRT1064_platform.Include_core_cm7">
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <require Cclass="CMSIS" Cgroup="CORE" Cversion="5.1.1"/>
    </condition>
    <condition id="devices.MIMXRT1064xxxxA_mdk">
      <require Tcompiler="ARMCC"/>
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
    </condition>
    <condition id="devices.MIMXRT1064xxxxA_iar">
      <require Tcompiler="IAR"/>
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
    </condition>
    <condition id="mdk">
      <require Tcompiler="ARMCC"/>
    </condition>
    <condition id="iar">
      <require Tcompiler="IAR"/>
    </condition>
    <condition id="devices.MIMXRT1064">
      <accept Dname="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064CVL5A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
      <accept Dname="MIMXRT1064xxxxA" Dvariant="MIMXRT1064DVL6A" Dvendor="NXP:11"/>
    </condition>
  </conditions>
  <components>
    <component Cclass="Device" Cgroup="Startup" Cversion="1.0.0" condition="devices.MIMXRT1064_platform.Include_core_cm7">
      <description></description>
      <files>
        <file name="arm/startup_MIMXRT1064.s" category="sourceAsm" condition="mdk" attr="config"/>
        <file name="iar/startup_MIMXRT1064.s" category="sourceAsm" condition="iar" attr="config"/>
        <file name="MIMXRT1064.h" category="header" attr="config"/>
        <file name="MIMXRT1064_features.h" category="header" attr="config"/>
        <file name="fsl_device_registers.h" category="header" attr="config"/>
        <file name="arm/MIMXRT1064xxxxx_flexspi_nor.scf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_mdk" attr="config"/>
        <file name="arm/MIMXRT1064xxxxx_flexspi_nor_sdram.scf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_mdk" attr="config"/>
        <file name="arm/MIMXRT1064xxxxx_ram.scf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_mdk" attr="config"/>
        <file name="arm/MIMXRT1064xxxxx_sdram.scf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_mdk" attr="config"/>
        <file name="arm/MIMXRT1064xxxxx_sdram_txt.scf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_mdk" attr="config"/>
        <file name="iar/MIMXRT1064xxxxx_flexspi_nor.icf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_iar" attr="config"/>
        <file name="iar/MIMXRT1064xxxxx_flexspi_nor_sdram.icf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_iar" attr="config"/>
        <file name="iar/MIMXRT1064xxxxx_ram.icf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_iar" attr="config"/>
        <file name="iar/MIMXRT1064xxxxx_sdram.icf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_iar" attr="config"/>
        <file name="iar/MIMXRT1064xxxxx_sdram_txt.icf" category="linkerScript" condition="devices.MIMXRT1064xxxxA_iar" attr="config"/>
        <file name="system_MIMXRT1064.c" category="sourceC" attr="config"/>
        <file name="system_MIMXRT1064.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="Board Support" Cgroup="SDK Project Template" Cversion="1.0.0" Csub="project_template" Cvariant="MIMXRT1064" isDefaultVariant="1" condition="devices.MIMXRT1064_device.MIMXRT1064_device.MIMXRT1064_startup_driver.clock_driver.common_driver.igpio_driver.iomuxc_utility.debug_console">
      <description></description>
      <files>
        <file name="project_template/board.c" category="sourceC" attr="config"/>
        <file name="project_template/board.h" category="header" attr="config"/>
        <file name="project_template/clock_config.c" category="sourceC" attr="config"/>
        <file name="project_template/clock_config.h" category="header" attr="config"/>
        <file name="project_template/peripherals.c" category="sourceC" attr="config"/>
        <file name="project_template/peripherals.h" category="header" attr="config"/>
        <file name="project_template/pin_mux.c" category="sourceC" attr="config"/>
        <file name="project_template/pin_mux.h" category="header" attr="config"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="I2C" Cversion="2.0.0" Csub="lpi2c_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.I2C_CMSISInclude_device.MIMXRT1064_driver.lpi2c">
      <description>LPI2C CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_lpi2c_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_lpi2c_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="SPI" Cversion="2.0.0" Csub="lpspi_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.SPI_CMSISInclude_device.MIMXRT1064_driver.lpspi">
      <description>LPSPI CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_lpspi_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_lpspi_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="CMSIS Driver" Cgroup="USART" Cversion="2.0.0" Csub="lpuart_cmsis" condition="RTE_Device_platform.CMSIS_Driver_Include.USART_CMSISInclude_device.MIMXRT1064_driver.lpuart">
      <description>LPUART CMSIS Driver</description>
      <files>
        <file name="cmsis_drivers/fsl_lpuart_cmsis.c" category="sourceC"/>
        <file name="cmsis_drivers/fsl_lpuart_cmsis.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="adc_12b1msps_sar" condition="device.MIMXRT1064_driver.common">
      <description>ADC Driver</description>
      <files>
        <file name="drivers/fsl_adc.c" category="sourceC"/>
        <file name="drivers/fsl_adc.h" category="header"/>
      </files>
    </component>
