saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MIMXRT1064_DFP.10.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="adc_etc" condition="device.MIMXRT1064_driver.common">
      <description>ADC_ETC Driver</description>
      <files>
        <file name="drivers/fsl_adc_etc.c" category="sourceC"/>
        <file name="drivers/fsl_adc_etc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="aipstz" condition="device.MIMXRT1064_driver.common">
      <description>aipstz Driver</description>
      <files>
        <file name="drivers/fsl_aipstz.c" category="sourceC"/>
        <file name="drivers/fsl_aipstz.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="aoi" condition="device.MIMXRT1064_driver.common">
      <description>AOI Driver</description>
      <files>
        <file name="drivers/fsl_aoi.c" category="sourceC"/>
        <file name="drivers/fsl_aoi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="bee" condition="device.MIMXRT1064_driver.common">
      <description>BEE Driver</description>
      <files>
        <file name="drivers/fsl_bee.c" category="sourceC"/>
        <file name="drivers/fsl_bee.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="cache" condition="device.MIMXRT1064_driver.common">
      <description>CACHE Driver</description>
      <files>
        <file name="drivers/fsl_cache.c" category="sourceC"/>
        <file name="drivers/fsl_cache.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="clock" condition="device.MIMXRT1064_driver.common">
      <description>Clock Driver</description>
      <files>
        <file name="drivers/fsl_clock.c" category="sourceC"/>
        <file name="drivers/fsl_clock.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="cmp" condition="device.MIMXRT1064_driver.common">
      <description>CMP Driver</description>
      <files>
        <file name="drivers/fsl_cmp.c" category="sourceC"/>
        <file name="drivers/fsl_cmp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="common" condition="device.MIMXRT1064_driver.common">
      <description>COMMON Driver</description>
      <files>
        <file name="drivers/fsl_common.c" category="sourceC"/>
        <file name="drivers/fsl_common.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="csi" condition="device.MIMXRT1064_driver.common">
      <description>CSI Driver</description>
      <files>
        <file name="drivers/fsl_csi.c" category="sourceC"/>
        <file name="drivers/fsl_csi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="dcdc_1" condition="device.MIMXRT1064_driver.common">
      <description>DCDC Driver</description>
      <files>
        <file name="drivers/fsl_dcdc.c" category="sourceC"/>
        <file name="drivers/fsl_dcdc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="dcp" condition="device.MIMXRT1064_driver.common">
      <description>DCP Driver</description>
      <files>
        <file name="drivers/fsl_dcp.c" category="sourceC"/>
        <file name="drivers/fsl_dcp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="dmamux" condition="device.MIMXRT1064_driver.common">
      <description>DMAMUX Driver</description>
      <files>
        <file name="drivers/fsl_dmamux.c" category="sourceC"/>
        <file name="drivers/fsl_dmamux.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.3" Csub="edma" condition="device.MIMXRT1064_driver.common">
      <description>EDMA Driver</description>
      <files>
        <file name="drivers/fsl_edma.c" category="sourceC"/>
        <file name="drivers/fsl_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="elcdif" condition="device.MIMXRT1064">
      <description>ELCDIF Driver</description>
      <files>
        <file name="drivers/fsl_elcdif.c" category="sourceC"/>
        <file name="drivers/fsl_elcdif.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="enc" condition="device.MIMXRT1064_driver.common">
      <description>ENC Driver</description>
      <files>
        <file name="drivers/fsl_enc.c" category="sourceC"/>
        <file name="drivers/fsl_enc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.3" Csub="enet" condition="device.MIMXRT1064_driver.common">
      <description>ENET Driver</description>
      <files>
        <file name="drivers/fsl_enet.c" category="sourceC"/>
        <file name="drivers/fsl_enet.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="ewm" condition="device.MIMXRT1064_driver.common">
      <description>EWM Driver</description>
      <files>
        <file name="drivers/fsl_ewm.c" category="sourceC"/>
        <file name="drivers/fsl_ewm.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.3" Csub="flexcan" condition="device.MIMXRT1064_driver.common">
      <description>FLEXCAN Driver</description>
      <files>
        <file name="drivers/fsl_flexcan.c" category="sourceC"/>
        <file name="drivers/fsl_flexcan.h" category="header"/>
      </files>
    </component>
