saffetblt/ARM-STM32F4-ECLIPSE/Packages/.cache/NXP.MIMXRT1064_DFP.10.0.0.pdsc
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="flexio" condition="device.MIMXRT1064_driver.common">
      <description>FLEXIO Driver</description>
      <files>
        <file name="drivers/fsl_flexio.c" category="sourceC"/>
        <file name="drivers/fsl_flexio.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.6" Csub="flexio_i2c_master" condition="device.MIMXRT1064_driver.flexio">
      <description>FLEXIO I2C Driver</description>
      <files>
        <file name="drivers/fsl_flexio_i2c_master.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_i2c_master.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.6" Csub="flexio_i2s" condition="device.MIMXRT1064_driver.flexio">
      <description>FLEXIO I2S Driver</description>
      <files>
        <file name="drivers/fsl_flexio_i2s.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_i2s.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.5" Csub="flexio_i2s_edma" condition="device.MIMXRT1064_driver.edma_driver.flexio_i2s">
      <description>FLEXIO I2S EDMA Driver</description>
      <files>
        <file name="drivers/fsl_flexio_i2s_edma.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_i2s_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.3" Csub="flexio_spi" condition="device.MIMXRT1064_driver.flexio">
      <description>FLEXIO SPI Driver</description>
      <files>
        <file name="drivers/fsl_flexio_spi.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_spi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.3" Csub="flexio_spi_edma" condition="device.MIMXRT1064_driver.edma_driver.flexio_spi">
      <description>FLEXIO SPI EDMA Driver</description>
      <files>
        <file name="drivers/fsl_flexio_spi_edma.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_spi_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.4" Csub="flexio_uart" condition="device.MIMXRT1064_driver.flexio">
      <description>FLEXIO UART Driver</description>
      <files>
        <file name="drivers/fsl_flexio_uart.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_uart.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.4" Csub="flexio_uart_edma" condition="device.MIMXRT1064_driver.edma_driver.flexio_uart">
      <description>FLEXIO UART EDMA Driver</description>
      <files>
        <file name="drivers/fsl_flexio_uart_edma.c" category="sourceC"/>
        <file name="drivers/fsl_flexio_uart_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="flexram" condition="device.MIMXRT1064">
      <description>FLEXRAM Driver</description>
      <files>
        <file name="drivers/fsl_flexram.c" category="sourceC"/>
        <file name="drivers/fsl_flexram.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.3" Csub="flexspi" condition="device.MIMXRT1064_driver.common">
      <description>FLEXSPI Driver</description>
      <files>
        <file name="drivers/fsl_flexspi.c" category="sourceC"/>
        <file name="drivers/fsl_flexspi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.0" Csub="gpc" condition="device.MIMXRT1064_driver.common">
      <description>GPC Driver</description>
      <files>
        <file name="drivers/fsl_gpc.c" category="sourceC"/>
        <file name="drivers/fsl_gpc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="gpt" condition="device.MIMXRT1064">
      <description>GPT Driver</description>
      <files>
        <file name="drivers/fsl_gpt.c" category="sourceC"/>
        <file name="drivers/fsl_gpt.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.1" Csub="gpio" condition="device.MIMXRT1064">
      <description>GPIO Driver</description>
      <files>
        <file name="drivers/fsl_gpio.c" category="sourceC"/>
        <file name="drivers/fsl_gpio.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="iomuxc" condition="device.MIMXRT1064_driver.common">
      <description>IOMUXC Driver</description>
      <files>
        <file name="drivers/fsl_iomuxc.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.0" Csub="kpp" condition="device.MIMXRT1064_driver.common">
      <description>KPP Driver</description>
      <files>
        <file name="drivers/fsl_kpp.c" category="sourceC"/>
        <file name="drivers/fsl_kpp.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.5" Csub="i2c" condition="device.MIMXRT1064_driver.common">
      <description>LPI2C Driver</description>
      <files>
        <file name="drivers/fsl_lpi2c.c" category="sourceC"/>
        <file name="drivers/fsl_lpi2c.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.1.5" Csub="i2c_edma" condition="device.MIMXRT1064_driver.lpi2c">
      <description>LPI2C Driver</description>
      <files>
        <file name="drivers/fsl_lpi2c_edma.c" category="sourceC"/>
        <file name="drivers/fsl_lpi2c_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="lpspi" condition="device.MIMXRT1064_driver.common">
      <description>LPSPI Driver</description>
      <files>
        <file name="drivers/fsl_lpspi.c" category="sourceC"/>
        <file name="drivers/fsl_lpspi.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.0.2" Csub="lpspi_edma" condition="device.MIMXRT1064_driver.lpspi">
      <description>LPSPI Driver</description>
      <files>
        <file name="drivers/fsl_lpspi_edma.c" category="sourceC"/>
        <file name="drivers/fsl_lpspi_edma.h" category="header"/>
      </files>
    </component>
    <component Cclass="Device" Cgroup="SDK Drivers" Cversion="2.2.5" Csub="lpuart" condition="device.MIMXRT1064_driver.common">
      <description>LPUART Driver</description>
      <files>
        <file name="drivers/fsl_lpuart.c" category="sourceC"/>
        <file name="drivers/fsl_lpuart.h" category="header"/>
      </files>
    </component>
